# CopyImposterLightWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CopyImposterLightWarn Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Light source cannot be copied!
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CopyImposterLightWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CopyImposterLightWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CopyImposterLightWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace